app/views/turmas/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "turmas_users" ON "users"."id" = "turmas_users"."user_id" WHERE "turmas_users"."turma_id" = ?  [["turma_id", 1]]
---
      <div class="card-body">
        <% @turma.users.each do |aluno| %>