app/controllers/teewts_controller.rb

SELECT "teewts".* FROM "teewts"
---
  def index
    @teewts = Teewt.all

SELECT "teewts".* FROM "teewts" WHERE "teewts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @teewt = Teewt.find(params[:id])

INSERT INTO "teewts" ("user_id", "conteudo", "created_at", "updated_at", "photo") VALUES (?, ?, ?, ?, ?)  [["user_id", 8], ["conteudo", "asdfgh"], ["created_at", "2022-11-26 14:49:42.776861"], ["updated_at", "2022-11-26 14:49:42.776861"], ["photo", nil]]
---
  def create
    @teewt = current_user.teewts.new(teewt_params)


      if @teewt.save

UPDATE "teewts" SET "updated_at" = ? WHERE "teewts"."id" = ?  [["updated_at", "2022-11-26 14:58:42.377669"], ["id", 5]]
---
  def update
    @teewt = current_user.teewts.find(params[:id])
      if @teewt.update(teewt_params)

SELECT "teewts".* FROM "teewts" WHERE "teewts"."user_id" = ? AND "teewts"."id" = ? LIMIT ?  [["user_id", 6], ["id", 1], ["LIMIT", 1]]
DELETE FROM "teewts" WHERE "teewts"."id" = ?  [["id", 1]]
---
  def destroy
    @teewt = current_user.teewts.find(params[:id])
    @teewt.destroy