app/controllers/turmas_controller.rb

  def addaluno
    @turma = Turma.find(params[turma_id])
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @turmas = Turma.all
---
SELECT "turmas".* FROM "turmas"

  def show
    @turma = Turma.find(params[:id])
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @turma = Turma.new(turma_params)

    respond_to do |format|
      if @turma.save
---
INSERT INTO "turmas" ("nome", "inicio", "fim", "horas", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @turma.update(turma_params)
---
UPDATE "turmas" SET "horas" = ?, "updated_at" = ? WHERE "turmas"."id" = ?  [["horas", 40.0], ["updated_at", "2022-09-24 15:29:04.497029"], ["id", 1]]

    def set_turma
      @turma = Turma.find(params[:id])
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]